#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/PosTechFiap33/ControlePedido/runs/run-YrHsn8Y2G2hNtcUS

Waiting for the plan to start...

Terraform v1.9.6
on linux_amd64
Initializing plugins and modules...
aws_subnet.eks_subnet_2: Refreshing state... [id=subnet-0b1fa6d7652265c3f]
aws_vpc.eks_vpc: Refreshing state... [id=vpc-09ef8265105bb08c5]
aws_eks_cluster.controle_pedidos_eks: Refreshing state... [id=controle-pedidos-cluster]
aws_subnet.eks_subnet_1: Refreshing state... [id=subnet-042233fb550c997fe]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_cluster.controle_pedidos_eks must be replaced
-/+ resource "aws_eks_cluster" "controle_pedidos_eks" {
      ~ arn                       = "arn:aws:eks:us-east-1:752307938219:cluster/controle-pedidos-cluster" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJU1kybmtEdjFhdG93RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNU1qZ3dNakUyTkRCYUZ3MHpOREE1TWpZd01qSXhOREJhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUQrZzlQTHdMR1NzQkdIVElkTG1RMVpRSldTaW5xcnRUYzdKTEp6TnJ4ZzRZMHFHc2EwYmJjUmpBK0wKSDE1OUU5UlBhTXZOUkN0YTI0azBDb2tZZDZsb290VGo1U0FZd3hHaVZ6dzIvK3JOQmZ5b3Vkc1ZBc1JsNVg3cApxR3UyTmQ5SHlCOW9tK2ZjTWdyYWlzbUlFZkR5WnU5dWxEYUY3d1ZnVmUyL2tPMUw2Vzl0MTNrcEVYREg2MFJwClNrSmhpMW1xTGxwRmFTR2R2dXZXVXVINVlDeG1wc1pVVmpCdFVsbXVtZGFPZkRtRUtZL2VRQXhCalozRytBcUEKcm5WcTZ6QVZ0bWhwUk9XSmhNdWF2MXk1WjJSL0RDb2dLcVF6a0N2Z0ZhQ0VPaTB5TWNUUkgrazBrSVhFTkJ1dQp1SG96dVNvTXBSQzJCY1BuY0R4ZFljWEhQUlhoQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJSUE9IbWZvSDJxNHp5RkU2czdEbnpTckkxVFlEQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQkhRQ0RUdk80TQpEODBPbXlUOXVDa215Q0Y2eFg5NlhKZ2NPTG1henpXakJCY3h5Zm96ZDBLY0MwZjFhL1pmNEVnbHdlSDVFakRQCkhMZllQb1diNWFRVnRKanlPUkVnZXd0b1lVZG1JRyszVzJ6TDVOUk42a3NhV2ZEOFdUVjI1SlVmMHpJUUhZK1QKaHpUVkxjMDNReEFEYUx6UGhXVm16WlQvZW52Mi9QbVVMMTlZRVFQbkVpUHcybzZkVGQ2NlExQUdOTTlmOWFYSQp5VVZQeGRzdHp1aVo0MHNSQldScUtFUGo3YzFBUmRLTmZTSE9ES1F3NXpad1lzWXRNWjhmbk1LZktaOG5NcVllCmJHMlJ3dUJhSDhPdXBnVGs4VS9XZE5KS3ZaYjNBS2t2WDhGcHFLWHBuYk9jcmhXaVBrVWg4NytIN2JEYkZqeUgKUHpORWo5QnRDRk1GCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> (known after apply)
      + cluster_id                = (known after apply)
      ~ created_at                = "2024-09-28 02:16:40.943 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://1DD3E4189F772A96982644CD9D57B19A.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "controle-pedidos-cluster" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/1DD3E4189F772A96982644CD9D57B19A"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "controle-pedidos-cluster"
      ~ platform_version          = "eks.8" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      - tags                      = {} -> null
      ~ tags_all                  = {} -> (known after apply)
      ~ version                   = "1.30" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ kubernetes_network_config (known after apply)
      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null
            # (1 unchanged attribute hidden)
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-008ba4f367e252cce" -> (known after apply)
          ~ public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> (known after apply)
          - security_group_ids        = [] -> null
          ~ subnet_ids                = [ # forces replacement
              - "subnet-042233fb550c997fe",
              - "subnet-0b1fa6d7652265c3f",
              + "subnet-05328cfe41f0e19ec",
              + "subnet-0f2d12653bd147eff",
            ]
          ~ vpc_id                    = "vpc-09ef8265105bb08c5" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_eks_node_group.controle_pedido_node_group will be created
  + resource "aws_eks_node_group" "controle_pedido_node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "controle-pedidos-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t2.micro",
        ]
      + node_group_name        = "controle-pedido-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::752307938219:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-05328cfe41f0e19ec",
          + "subnet-0f2d12653bd147eff",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_subnet.eks_subnet_1 will be destroyed
  - resource "aws_subnet" "eks_subnet_1" {
      - arn                                            = "arn:aws:ec2:us-east-1:752307938219:subnet/subnet-042233fb550c997fe" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-042233fb550c997fe" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "752307938219" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-09ef8265105bb08c5" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_subnet.eks_subnet_2 will be destroyed
  - resource "aws_subnet" "eks_subnet_2" {
      - arn                                            = "arn:aws:ec2:us-east-1:752307938219:subnet/subnet-0b1fa6d7652265c3f" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0b1fa6d7652265c3f" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "752307938219" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-09ef8265105bb08c5" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_vpc.eks_vpc will be destroyed
  - resource "aws_vpc" "eks_vpc" {
      - arn                                  = "arn:aws:ec2:us-east-1:752307938219:vpc/vpc-09ef8265105bb08c5" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0bff3466a7d8ca8ee" -> null
      - default_route_table_id               = "rtb-00eb36ac4e61b7673" -> null
      - default_security_group_id            = "sg-063493358d284988d" -> null
      - dhcp_options_id                      = "dopt-09737c07a9dd4ca26" -> null
      - enable_classiclink                   = false -> null
      - enable_classiclink_dns_support       = false -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-09ef8265105bb08c5" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-00eb36ac4e61b7673" -> null
      - owner_id                             = "752307938219" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ cluster_endpoint = "https://1DD3E4189F772A96982644CD9D57B19A.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @FlavioRoberto, Action: `pull_request`*